{
  "ssl": {
    "name": "SSL/TLS",
    "link": "openssl",
    "opt": [
      "openssl 1.1.1 is one of the more performant versions",
      "If not using certain functionality boringssl can give better performance",
      "modern CPU architectures have more SIMD (single instruction multiple data) execution units and can often execute the cryptographic parts of networking much faster"
    ]
  },
  "libc": {
    "name": "glibc standard c library",
    "tags": {
      "NEON": "added in glibc-2.18"
    },
    "link": "glibc",
    "opt": [
      "You could be doing unecessary data copying. Pass data by reference when possible to prevent copies",
      "You could have lots of syscalls. Try batching any syscalls or look for optimized IO options like XDP (express data path) or io_uring for networking. Also some reads and writes can be batched."
    ]
  },
  "redis-server": {
    "name": "Redis",
    "link": "redis",
    "opt": [
      "Redis 6 added threads for IO which can offload some work from the otherwise single threaded tool."
    ]
  },
  "\/org\/apache\/spark": {
    "name": "Spark",
    "link": "spark",
    "opt": [
      "Try using a modern execution engine like velox"
    ]
  },
  "\/org\/apache\/cassandra": {
    "name": "Cassandra",
    "link": "cassandra",
    "opt": [
      "Premium optimizations"
    ]
  },
  "mongo": {
    "name": "Mongodb",
    "link": "mongodb",
    "opt": [
      "Verify that your indexes are being used with profile()",
      "Upgrade to v8 for performance"
    ]
  },
  "nginx": {
    "name": "nginx",
    "link": "nginx",
    "opt": [
      "Ensure you are using an optimized SSL/TLS",
      "See server health check section for network tunables"
    ]
  },
  "java": {
    "name": "Java",
    "link": "openjdk",
    "opt": [
      "openjdk 16+ has the vector api which enables more use of the SIMD api.",
      "Some of corretto's compression libraries are faster than openjdk's"
    ]
  },
  "envoy": {
    "name": "Envoy",
    "opt": [
      "Premium optimizations"
    ]
  },
  "kafka": {
    "name": "Kafka",
    "opt": [
      "Premium optimizations"
    ]
  },
  "tensorflow": {
    "name": "TensorFlow",
    "opt": [
      "Try quantizing your weights to better utilize underlying CPU execution units. Some companies offer tools for converting your models like Intel's neural compressor and oneDNN"
    ]
  },
  "(deflate|inflate)": {
    "name": "Deflate/Inflate compression",
    "opt": [
      "most compression benefits from newer CPUs and versions compiled to utilize advanced instruction sets"
    ]
  },
  "snappy": {
    "name": "Snappy",
    "tags": {
      "NEON": "added in Snappy version 1.1.10"
    },
    "opt": [
      "Snappy is more performant when compiled with clang instead of GCC",
      "Optimized to use SIMD instructions on modern CPU architectures, try upgrading to a newer CPU"
    ]
  },
  "zstd": {
    "name": "Z Standard",
    "opt": [
      "Can be offloaded with Intel's QAT which is on Sapphire rapids or later architectures",
      "Optimized to use SIMD instructions on modern CPU architectures, try upgrading to a newer CPU"
    ]
  },
  "prometheus": {
    "name": "Prometheus",
    "opt": [
      "Try reducing the scrape_interval to limit overhead"
    ]
  },
  "alloc": {
    "name": "Allocators",
    "opt": [
      "TCmalloc can be used to improve performance on multithreaded allocation workloads by maintaining a per-cpu cache and zoning to prevent fragmentation"
    ]
  },
  " GC ": {
    "name": "Garbage Collection",
    "opt": [
      "Using parallel garbage collection reduces overhead"
    ]
  },
  "swapper": {
    "name": "swapper",
    "opt": [
      "server is either under utilized or idling on IO. Either downsize or add more work"
    ]
  }
}